 const CHALLENGES = [
  {
    id: "cmd_print_name",
    group: "basics",
    topic: "פקודה",
    title: "היי :) האתגר הראשון שלכם בתכנות למתחילים",
    subtitle: "אנחנו מיינדפלי - אצלנו לומדים לתכנת משחקים בחוג בזום, מוזמנים לשלוח הודעה בווצאפ <a href='https://did.li/QVeIw'>055-6662173</a> ולהצטרף לשיעור ניסיון אצלנו !",
    explain: "הפקודה הראשונה שלומדים בתכנות היא ()print. היא מאפשרת לנו להציג טקסט או מידע על המסך. המחשב מריץ את הקוד, וכל מה שנכתוב בתוך הסוגריים () יודפס כפלט. דוגמה: ('היי')print",
    task: 'כתוב שורה אחת שמדפיסה את המילה "שלום".',
    hint: 'הטקסט שבתוך הפרינט יהיה מוקף ב"גרשיים" ובסוגריים() לא לשכוח לא לעשות רווחים מיותרים לפני הפקודה',
    starter: ``,
    solution: `print("שלום")`,
    expectedOutput: "שלום",
    fallback: {
      type: "quiz",
      question: 'איזו שורה מדפיסה בפייתון את המילה "שלום"?',
      options: ['echo("שלום")', 'print("שלום")', 'console.log("שלום")', 'say("שלום")'],
      correctIndex: 1,
      explainCorrect: 'בפייתון מדפיסים עם print() והטקסט בתוך גרשיים.'
    }
  }
]
